{
    "Что такое кибербезопасность?": "Область знаний, включающая технологии, людей, информацию и процессы для защиты систем от злоумышленников.",
    "Какой из элементов не является основным свойством информации?": "Универсальность.",
    "Какая атака направлена на нарушение доступности системы?": "DoS (Denial of Service).",
    "Что обозначает термин \"конфиденциальность\"?": "Защита информации от несанкционированного доступа.",
    "Что является примером актива в кибербезопасности?": "Конфиденциальные данные компании.",
    "Что понимается под термином \"средство управления\"?": "Действия, изменяющие риск.",
    "Что означает термин \"доступность\" в кибербезопасности?": "доступными и функциональными для авторизованных пользователей при необходимости.",
    "Какой подход помогает предотвратить возможные риски?": "Мыслить, как злоумышленник.",
    "Какая область знаний связана с защитой данных в личной жизни?": "Защита персональных данных (Data Privacy)",
    "Что является примером средств управления?": "Огнетушители для защиты документов от пожара.",
    "Какая цель может преследоваться при внутренней киберпреступности?": "кражу данных, саботаж, коммерческий шпионаж, вымогательство",
    "Какую сумму ущерба приносит пиратство разработчикам ежегодно?": "миллиарды долларов ежегодно",
    "Какой орган определён ответственным за кибербезопасность в Узбекистане?": "Государственный комитет по кибербезопасности Республики Узбекистан.",
    "Что может произойти, если пользователь выберет небезопасный вариант при предупреждении браузера?": "компрометации данных, заражению устройства вредоносным ПО, перехвату конфиденциальной информации и другим угрозам безопасности.",
    "Какой метод социальной инженерии чаще всего используют мошенники?": "фишинг",
    "Почему телефон остается эффективным инструментом социальной инженерии?": "Невозможно подтвердить личность собеседника.",
    "Какой фактор чаще всего приводит к внутренним угрозам в организациях?": "Недовольство и невнимательность сотрудников.",
    "Какой из человеческих факторов чаще всего приводит к нарушению кибербезопасности?": "Недостаток знаний в области кибербезопасности.",
    "Какие меры нужно принимать при угрозах, связанных с мгновенными сообщениями?": "Выбрать единую платформу и установить параметры безопасности. 5. Что характеризует уровень RAID 0?",
    "Что обеспечивает архитектура предприятия?": "Формирование набора принципов, подходов и технологий для трансформации и развития организации.",
    "Сколько уровней выделяют в архитектуре предприятия?": "Концептуальный, логический и технологический.",
    "Что из перечисленного не относится к задачам политики безопасности?": "разработка новых бизнес-стратегий/ Оптимизация производительности",
    "Какую задачу выполняет инвентаризация системы?": "идентифицировать и отслеживать/ учета и контроля всех IT-ресурсов организации",
    "Что характеризует стратегия кибербезопасности?": "Комплекс действий для достижения целей безопасности.",
    "Что необходимо учитывать при создании архитектуры кибербезопасности?": "учитывать риски, угрозы, уязвимости, требования законодательства, лучшие практики и стандарты, а также специфику бизнеса и IT-инфраструктуру.",
    "Какое преимущество дает политика безопасности?": "Обеспечивает четкие правила и процедуры для защиты информации и IT-ресурсов, а также помогает минимизировать риски и предотвращать инциденты безопасности.",
    "Что должно быть выполнено при составлении сетевой карты?": "Определение информационного потока в каждой системе.",
    "Какая характеристика политики безопасности важна для ее реализации?": "ясность и конкретность",
    "Какую задачу решает политика информационной безопасности организации (EISP)?": "Обеспечивает безопасную среду организации, предлагая цели и методы.",
    "Что включает политика безопасности, ориентированная на систему (SSSP)?": "Процедуры и стандарты для обеспечения безопасности определённой системы.",
    "Что является основным предметом изучения криптографии?": "методы и средства защиты информации путем преобразования ее в зашифрованный вид",
    "Какое свойство информации обеспечивается криптографическими хеш-функциями?": "целостность информации, позволяя обнаружить любые изменения данных.",
    "Какая криптографическая система использует два ключа?": "Криптография с открытым ключом.",
    "Какой основной недостаток симметричных криптосистем?": "сложность управления ключами",
    "Что представляет собой шифр Вернама (одноразовый блокнот)?": "Надежный алгоритм шифрования с использованием ключа, который применяется только один раз.",
    "Что характеризует отражение перестановки?": "порядка битов в блоке данных, что затрудняет анализ и предсказание структуры зашифрованного сообщения.",
    "Что такое симметричная криптосистема?": "один и тот же ключ используется для шифрования и дешифрования данных.",
    "Какой принцип работы лежит в основе алгоритма Цезаря?": "принципе замены",
    "Что представляет собой полиалфавитный шифр?": "Шифр, использующий несколько алфавитов для замены символов.",
    "Какая особенность характеризует полиалфавитный шифр в отличие от обычного шифра Цезаря?": "Использование различных алфавитов для каждой буквы текста.",
    "Какую задачу решают перестановки в симметричных криптосистемах?": "Изменение местоположения символов в блоках текста.",
    "Что является основным принципом криптосистем с открытым ключом?": "может быть распространен, и приватного ключа, который хранится в секрете",
    "Какие математические концепции лежат в основе криптосистем с открытым ключом?": "факторизация больших чисел и вычисление дискретных логарифмов",
    "Что такое приватный ключ в криптосистеме с открытым ключом?": "используется для расшифровки данных",
    "Какой математический принцип лежит в основе криптосистемы RSA?": "Использование произведения двух простых чисел для создания открытого и закрытого ключей.",
    "Что такое открытый ключ в криптосистеме RSA?": "Ключ, который используется для шифрования и проверки подписи.",
    "Что такое факторизация в контексте криптосистемы RSA?": "процесс разложения числа на множители",
    "Что делает хэш-функция?": "преобразует входные данные произвольной длины",
    "Какое из свойств принадлежит хэш-функции?": "детерминированность, необратимость и устойчивость к коллизиям",
    "Что отправляется получателю вместе с сообщением для проверки целостности данных?": "Хэш-значение сообщения",
    "Что представляет собой MAC?": "короткий фрагмент данных",
    "В каком режиме работы блочного шифра используется MAC?": "CBC (Cipher Block Chaining)",
    "Какой метод создания MAC на основе хэш-функций более безопасен?": "HMAC",
    "Что используется в HMAC для дополнительной безопасности?": "секретный ключ",
    "Какая длина блока используется в хэш-функциях, таких как MD5 или SHA1?": "длина блока 512 бит",
    "Какая основная функция устройства ruToken USB?": "Защита ключей шифрования, ЭЦП и сертификатов",
    "К какому классу относятся устройства ruToken USB?": "аппаратных средств криптографической защиты информации",
    "Какой процесс выполняет аппаратное средство защиты информации?": "шифрование и дешифрование данных",
    "Какое преимущество аппаратно-программного шифрования?": "Отсутствие зависимости от операционной системы",
    "Каким требованиям безопасности должно соответствовать устройство ruToken USB?": "несанкционированного доступа, надежное хранение ключей и соответствие стандартам криптографической защиты",
    "Какие механизмы используются для уничтожения бумажных носителей?": "Перемалывание и шредирование",
    "Что является примером идентификации?": "Логин и пароль",
    "Какой процесс включает предоставление уникального идентификатора системе?": "Идентификация",
    "Что включает в себя процесс контроля доступа?": "идентификацию, авторизацию и аудит",
    "Как называется система, в которой пароль меняется на одноразовый после каждого сеанса?": "одноразовым паролем (OTP)",
    "Что происходит в асинхронных системах управления паролями?": "может быть изменен без ожидания синхронизации между пользователем и сервером",
    "Какое требование к паролю способствует его устойчивости?": "Использование заглавных букв и специальных символов",
    "Что является основным недостатком статических паролей?": "Легкость их раскрытия",
    "Что иллюстрирует понятие \"многоуровневая защита\"?": "пароли, биометрия, физические барьеры",
    "Какая основная проблема безопасности метода DAC?": "Отсутствие гарантии, что данные не будут переданы неавторизованным пользователям",
    "Что является основным преимуществом метода RBAC?": "упрощает управление доступом",
    "Какие из ниже перечисленных факторов являются естественными угрозами для физической безопасности?": "Наводнение, землетрясение, пожар",
    "Какая из угроз является искусственной, то есть вызвана человеком?": "взлом, вандализм или терроризм.",
    "Что такое социальная инженерия в контексте физической безопасности?": "манипулирования людьми",
    "Какое событие может вызвать повреждение электроснабжения и оборудования в организации?": "Молния и гроза",
    "Какие устройства наиболее подвержены угрозам из-за короткого замыкания или неисправностей?": "Электронное оборудование",
    "Какой из следующих методов контроля физической безопасности ориентирован на использование технологий для контроля доступа к физическим активам?": "Технический контроль",
    "Что представляет собой физический контроль в контексте безопасности организации?": "охраны, систем видеонаблюдения, барьеров, замков",
    "Какое из нижеперечисленных является примером активной системы защиты от пожара?": "спринклерная система.",
    "Какое из утверждений относится к противопожарным пассивным системам защиты?": "противопожарные двери, огнестойкие стены и огнезащитные покрытия",
    "Какая система охраны используется для предотвращения несанкционированного входа на территорию организации?": "Охранники и камеры видеонаблюдения",
    "Какие из следующих типов сетей являются локальными?": "LAN (Local Area Network)",
    "Что такое топология \"звезда\"?": "Каждый компьютер подключен к центральному концентратору",
    "Какую топологию характеризует общая шина?": "устройства подключены к одной общей линии",
    "Какая топология считается \"активной\"?": "Топология \"кольцо\"(звезда)",
    "Что такое модель OSI?": "данные передаются по сети, разделяя процесс на семь уровней: физический, канальный, сетевой, транспортный, сеансовый, представительный и прикладной",
    "Какой из следующих уровней модели OSI отвечает за передачу данных по физической линии связи?": "Физический",
    "Что делает межсетевой экран (firewall)?": "защищает сеть путем фильтрации",
    "Какой из следующих протоколов является протоколом туннелирования канального уровня типа \"точка-точка\"?": "PPTP (Point-to-Point Tunneling Protocol)",
    "Что является основной функцией системы обнаружения вторжений (IDS)?": "выявления подозрительной активности или нарушений безопасности",
    "Что такое UTM (Unified Threat Management)?": "Комплексное решение для защиты периметра сети",
    "Какие технологии использует VPN для защиты передаваемых данных?": "Инкапсуляция, шифрование, аутентификация",
    "Какие типы беспроводных сетей существуют?": "Wi-Fi, Bluetooth, Zigbee, Cellular Networks",
    "Какая из угроз безопасности является основной для мобильных сетей?": "вредоносное ПО (malware)",
    "Что позволяет злоумышленнику совершить скрытое подслушивание в беспроводной сети?": "недостаточная защита сети",
    "Какова основная угроза при атаке типа DoS в беспроводных сетях?": "Принуждение к отказу от обслуживания",
    "Какая атака используется для перехвата и изменения данных в сеансе связи?": "Атака посредника (MITM)",
    "Какой механизм помогает решить проблему роуминга в беспроводных сетях?": "Использование мобильных IP-адресов",
    "Что важно сделать с текущими паролями сетевых устройств?": "Изменить их перед использованием",
    "Какое из следующих уравнений правильно описывает взаимосвязь между понятием риска, угрозой, уязвимостью и воздействием?": "Риск = Угроза × Уязвимость × Воздействие",
    "Что характеризует воздействие риска?": "потенциальные последствия или вред",
    "Как классифицируются риски с точки зрения частоты?": "низкочастотные, среднечастотные и высокочастотные",
    "Какой уровень риска требует немедленных контрмер?": "Высокий уровень",
    "Что является основными задачами управления рисками?": "Выявление потенциальных рисков и помощь в разработке стратегий",
    "Какую роль выполняет главный управляющий в управлении рисками?": "руководителя процесса управления рисками",
    "Где наиболее эффективно реализуется внутреннее (onsite) резервирование?": "центрах обработки данных",
    "Какой метод резервного копирования является наименее безопасным?": "Холодное резервирование",
    "Что является основным недостатком ленточных дисков для резервного копирования?": "медленная скорость доступа/ долгое время восстановления данных",
    "Какой тип угрозы в программных средствах описывается как ошибки, допущенные программистами?": "уязвимость",
    "Какая из следующих угроз является результатом ошибки в проектировании программы?": "Дефект",
    "Какую из следующих угроз вызывает переполнение памяти при программировании?": "Переполнение буфера",
    "Какой тип бага может быть легко выявлен на этапе реализации программного обеспечения?": "Логические ошибки и синтаксические ошибки",
    "Что такое компьютерный вирус?": "копировать себя и распространяться на другие компьютеры",
    "Как можно классифицировать вирусы по среде обитания?": "Файловые, Загрузочные, Макровирусы, Сетевые вирусы",
    "Какие вирусы являются наиболее распространенными?": "Файловые вирусы.",
    "Что такое загрузочные вирусы?": "заражают загрузочные секторы жестких дисков и других носителей",
    "Какой вирус заражает макросы и файлы редакторов, таких как Microsoft Word?": "Макровирусы",
    "Как называются вирусы, использующие стелс-алгоритмы?": "Стелс-вирусы.",
    "Какой метод используется для поиска вирусов с помощью шаблонов или сигнатур?": "сигнатурным анализом",
    "Какой вирус может сохраняться в памяти и оставаться активным до перезапуска системы?": "Резидентный вирус.",
    "Где в реестре Windows хранится информация о событиях?": "HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\EventLog 14. Что является основной задачей области \"Безопасность связи\"?",
    "Какая цель записи событий в журнал Windows?": "Для определения причин ошибок и предотвращения атак.",
    "Какой тип события сигнализирует о проблемах, которые могут привести к ошибкам в будущем?": "Предупреждение.",
    "Что может привести к потере данных в случае ошибки системы?": "Удаление файла.",
    "Что такое социальная инженерия?": "манипуляции людьми для получения конфиденциальной информации или доступа к системам",
    "Какой метод социальной инженерии использует злоумышленник, прикидываясь сотрудником службы поддержки?": "прикидывается сотрудником службы поддержки, называется фишинг.",
    "Что из ниже перечисленного является мерой противодействия социальной инженерии?": "Регулярное обучение сотрудников.",
    "Какая техника социальной инженерии требует использования контактных данных и создания неполадок в системе?": "сценарий (претекстинг) для обмана жертвы и получения информации.",
    "Какой уровень RAID обеспечивает лучшую отказоустойчивость с минимальными затратами на оборудование?": "RAID 5",
    "Какой уровень RAID обеспечивает избыточность данных через зеркалирование?": "RAID 1",
    "Какой уровень RAID предлагает максимальную производительность и минимальную избыточность?": "RAID 0",
    "Какой уровень RAID использует две дисковые группы с зеркалированием и блоками данных для повышения отказоустойчивости?": "RAID 10",
    "Какой уровень RAID применяется для создания высокоскоростной системы с хорошей отказоустойчивостью и низкой стоимостью?": "RAID 5",
    "Какой термин описывает нежелательное событие, способное нанести ущерб системе?": "Угроза.",
    "Чем кибербезопасность отличается от информационной безопасности?": "Кибербезопасность защищает информацию в электронном виде.",
    "Что такое \"уязвимость\"?": "Недостаток в системе, позволяющий реализовать угрозу.",
    "Какое из следующих определений подходит к \"риску\"?": "Вероятность потери или ущерба.",
    "Какая область знаний кибербезопасности отвечает за разработку программных средств?": "Безопасность программного обеспечения.",
    "Как называется практика защиты систем и сетей от цифровых атак?": "Кибербезопасность.",
    "Что является основной задачей области \"Безопасность связи\"?": "Обеспечение физической и логической связи.",
    "Какая угроза наиболее распространена для нарушения доступности?": "Атака на отказ в обслуживании (DoS).",
    "Какое из утверждений верно для информационной безопасности?": "Она охватывает все аспекты защиты информации, включая ее форму.",
    "Что такое киберпреступность?": "Действия, направленные на взлом систем компьютерной защиты.",
    "Какие действия характерны для внешней киберпреступности?": "Сканирование ИТ-инфраструктуры организации.",
    "Что является основной целью киберпреступников?": "Незаконное присвоение денежных средств.",
    "Какие виды киберпреступности выделяются?": "Экономическая, против прав человека и против общественной безопасности.",
    "Как называется преступление, связанное с копированием программного обеспечения?": "Компьютерное пиратство.",
    "Что регулируют киберзаконы?": "Отношения в сфере кибербезопасности.",
    "Что подразумевает киберэтика?": "Поведение пользователей и влияние технологий на общество.",
    "Какое утверждение верно в отношении уязвимости пользователей в системе кибербезопасности?": "Пользователи считаются самой уязвимой точкой в системе кибербезопасности.",
    "Какой основной недостаток возникает при использовании сложных паролей?": "Необходимость их хранения, что может усугубить проблему.",
    "Что из перечисленного не относится к мерам предотвращения фишинга?": "Создание сложных многоуровневых паролей.",
    "Какие действия рекомендуются для защиты от угроз, связанных с электронной почтой?": "Подозрительно относиться к неожиданным сообщениям.",
    "Какова основная цель социальной инженерии?": "Получение конфиденциальной информации через психологические методы.",
    "Какие действия помогут снизить риск социальной инженерии?": "Обучение сотрудников навыкам социальной инженерии.",
    "Какой способ социальной инженерии чаще всего используется для хищения средств у пользователей мобильных телефонов?": "Мошеннические звонки или SMS-сообщения.",
    "Что из перечисленного не относится к мерам физической безопасности?": "Обеспечение шифрования данных клиентов.",
    "Какой из перечисленных методов лучше всего помогает предотвратить атаки социальной инженерии?": "Разработка надежной политики классификации данных.",
    "Какая структура описывает состояние системы информационной безопасности предприятия?": "Архитектура кибербезопасности.",
    "Что такое политика информационной безопасности?": "План высокого уровня, описывающий цели, задачи и меры обеспечения безопасности.",
    "Какие основные уровни иерархии политики безопасности?": "Законы, нормативные документы, политики, стандарты, инструкции, процедуры, общие правила.",
    "Какая характеристика политики безопасности включает \"соответствие кибер и юридическим законам\"?": "Соответствие законам, стандартам и инструкциям.",
    "Что делает политика безопасности с рисками?": "Снижает их вероятность.",
    "На какую проблему направлена политика безопасности ISSP?": "Проблемы, связанные с авторизацией прав доступа пользователей.",
    "Какой криптографический метод обеспечивает конфиденциальность информации?": "Криптосистемы с симметричным и асимметричным ключом.",
    "Что определяет ключ в криптографической системе?": "Конкретное значение параметров криптографического алгоритма.",
    "Что утверждает принцип Керкгоффа?": "В секрете должен храниться только ключ, алгоритм шифрования может быть открытым.",
    "Какая цель шифрования данных?": "Обеспечение конфиденциальности информации.",
    "Какая из характеристик описывает симметричные криптосистемы?": "Использование одного ключа для шифрования и расшифрования.",
    "Какой из алгоритмов является классическим примером симметричной криптосистемы?": "Алгоритм Цезаря.",
    "Какую задачу решает алгоритм Цезаря?": "Шифрование текста с использованием сдвига символов.",
    "Какая проблема существует при использовании алгоритма Цезаря в криптографии?": "Малая стойкость к анализу частот.",
    "Что представляет собой алгоритм замены с большим ключом?": "Шифрование текста с использованием более сложной подстановки с длинным ключом.",
    "Что отличает криптосистемы с открытым ключом от симметричных?": "Использование разных ключей для шифрования и расшифрования. ",
    "Что такое публичный ключ в криптосистеме с открытым ключом?": "Ключ, который доступен всем для шифрования сообщений.",
    "Какая из следующих операций используется в криптосистемах с открытым ключом для шифрования?": "Использование публичного ключа для шифрования сообщения.",
    "Какой из следующих элементов необходим для создания криптосистемы RSA?": "Два простых числа, их произведение и алгоритм для нахождения обратного элемента.",
    "Почему простой метод проверки целостности данных через хэш-функции не используется на практике?": "Возможность подмены хэш-значения злоумышленником",
    "Что делается, если длина ключа меньше длины блока в системе HMAC?": "Дополняется нулями",
    "Что такое аппаратно-программное шифрование?": "Процесс шифрования с использованием вычислительного устройства",
    "Какой интерфейс используется устройством ruToken USB?": "USB 2.0 и выше",
    "Что обеспечивает аппаратно-программный метод защиты информации?": "Комплексную защиту данных и доступа",
    "Какие данные могут храниться на ruToken USB?": "Ключи шифрования и сертификаты",
    "Какое из следующих понятий не относится к трем основным элементам контроля доступа?": "Шифрование",
    "Что проверяет аутентификация?": "Подлинность пользователя",
    "Какой пример иллюстрирует авторизацию?": "Проверка прав на установку программ",
    "Как называется процесс проверки подлинности, если обе стороны аутентифицируют друг друга?": "Двусторонняя аутентификация",
    "Какой пример иллюстрирует многофакторную аутентификацию?": "Использование ПИН-кода и смарт-карты",
    "К какому типу факторов относится использование смарт-карты?": "Что-то, что вы имеете",
    "Что учитывает показатель информационной энтропии?": "Количество символов в пароле и мощность алфавита",
    "Какой метод усиливает защиту паролем?": "Использование одноразовых паролей",
    "Что такое контроль доступа в контексте информационной безопасности?": "Ограничение доступа к системным ресурсам",
    "Что из следующего относится к методам управления доступом в системах?": "DAC, MAC, RBAC, ABAC",
    "Какой метод управления доступом предполагает, что владелец объекта определяет права на использование?": "DAC (Discretionary Access Control)",
    "Какое преимущество метода DAC в системах безопасности?": "Гибкость в определении прав доступа владельцем объекта",
    "Какой метод управления доступом используется для защиты объектов в зависимости от классификации субъекта и объекта?": "MAC (Mandatory Access Control)",
    "Что характерно для метода MAC?": "Централизованный контроль безопасности с фиксированными уровнями доступа 7. Какой основной недостаток возникает при использовании сложных паролей?",
    "Какие уровни безопасности обычно используются в методе MAC?": "Совершенно секретно, секретно, конфиденциально, открыто",
    "Какой из методов управления доступом использует роль как ключевой элемент для определения доступа?": "RBAC (Role-Based Access Control)",
    "Какова основная задача физической безопасности?": "Защита здания и активов организации от краж, вторжений и природных угроз",
    "Какой из факторов может вызвать коррозию или короткое замыкание в оборудовании?": "Высокая влажность",
    "Что включается в физический уровень защиты по модели OSI?": "Электроснабжение систем и кабелей",
    "Какую задачу решает первый уровень физической безопасности организации?": "Контролирует внешний доступ в помещение и движение транспортных средств",
    "Какой из типов угроз приводит к физическим повреждениям оборудования, не связанным с природными катастрофами?": "Воровство",
    "Что такое компьютерная сеть?": "Совокупность нескольких компьютеров для обмена ресурсами",
    "Что такое сервер в компьютерной сети?": "Компьютер, предоставляющий сетевые ресурсы",
    "Что такое экстронет?": "Корпоративная сеть, использующая для соединения метасеть Интернет",
    "Какую задачу выполняет транспортный уровень модели OSI?": "Обеспечивает доставку данных между приложениями",
    "Какая из перечисленных технологий используется для создания временного защищенного канала связи?": "VPN",
    "Что такое NAT (Network Address Translation)?": "Технология замены внутреннего адреса хоста на внешний",
    "Какую задачу решает система предотвращения утечек информации (DLP)?": "Блокирует передачу конфиденциальной информации",
    "Какой из перечисленных методов используется для выявления вторжений по характерным признакам атак?": "Сигнатурный метод",
    "Какой тип ловушек (honeypot) имеет низкий уровень интерактивности?": "Ловушки с эмуляцией одной сетевой службы",
    "Что делает ложная точка доступа в беспроводных сетях?": "Иммитирует сетевые ресурсы для сбора данных",
    "Какая мера предосторожности рекомендуется для защиты от атаки \"взгляд через плечо\"?": "Использование пароля для подключения",
    "Как можно ограничить доступ к беспроводной сети?": "С помощью проверки MAC-адресов",
    "Что такое риск в контексте кибербезопасности?": "Вероятность угрозы, которая может нанести ущерб ресурсам",
    "Что описывает уровень риска?": "Результат × вероятность",
    "Риски какого уровня можно не учитывать в краткосрочной перспективе?": "Низкий",
    "Какие функции выполняет директор по информационным технологиям в управлении рисками?": "Реализует политику и поддерживает IT-процессы",
    "Какой уровень RAID использует чередование данных с параллельной проверкой на ошибки?": "RAID 5",
    "Какой уровень RAID предоставляет лучший баланс между производительностью и избыточностью данных?": "RAID 5",
    "Что характеризует уровень RAID 0?": "Разделение данных на блоки без избыточности (строчечная запись)",
    "Какой уровень RAID предоставляет наибольшую степень отказоустойчивости с возможностью восстановления данных при сбое одного жесткого диска?": "RAID 6",
    "Какой уровень RAID использует четные и нечетные блоки для создания паритета и защиты от потери данных?": "RAID 5",
    "Что является основным недостатком уровня RAID 0?": "Отсутствие избыточности данных 14. Что регулируют киберзаконы?",
    "Какой язык программирования считается более безопасным из-за автоматического обнаружения ошибок при компиляции?": "C#",
    "Какой принцип безопасности предполагает ограничение доступа только к тем данным, которые необходимы для выполнения задач?": "Принцип минимальных привилегий",
    "Что является основным фактором, влияющим на безопасность программного обеспечения?": "Человеческий фактор в разработке",
    "Что приводит к рискам безопасности из-за большого количества разработчиков в проекте?": "Комплексность разработки",
    "Какой тип угрозы связан с намеренным воздействием на программное обеспечение с целью причинения ущерба?": "Вредоносные программы",
    "Какой принцип безопасности программы минимизирует область, подверженную атакам?": "Минимизация площади области, которую можно атаковать",
    "Что такое полиморфные вирусы?": "Вирусы, изменяющие свою структуру, чтобы избежать обнаружения.",
    "Что такое резидентный вирус?": "Вирус, который остается активным в памяти после завершения работы программы.",
    "Что такое журнал событий в операционной системе Windows?": "Стандартный способ записи и централизованного хранения информации о программных и аппаратных событиях.",
    "Какие типы файлов журналов предусмотрены по умолчанию в Windows?": "Журнал приложений, журнал безопасности, системный журнал.",
    "Какое событие записывается в журнал безопасности Windows?": "Попытки входа в систему (успешные или неудачные).",
    "Какая информация должна быть записана для каждого события в журнале?": "Отметка времени, код события, название службы.",
    "Что может происходить в случае переполнения журнала событий?": "Журнал может либо перезаписывать старые события, либо остановить запись.",
    "Какие данные могут быть записаны в журнал о сетевых событиях?": "Изменения или сбои в сетевом подключении.",
    "Что такое фишинг?": "Метод интернет-мошенничества, направленный на получение конфиденциальной информации.",
    "Какой из методов социальной инженерии использует поддельные сообщения для получения личных данных?": "Фишинг.",
    "Какое действие может выполнить злоумышленник при использовании метода «кви про кво»?": "Создать фальшивые проблемы и заставить жертву установить вредоносное ПО.",
    "Как называется метод, при котором злоумышленник подбрасывает носители с вредоносным ПО в общественные места?": "Дорожное яблоко.",
    "Как можно защититься от фишинговых атак?": "Обучение сотрудников по вопросам безопасности.",
    "Какую роль играют антивирусные программы в защите от социальной инженерии?": "Защищают от вредоносных программ, используемых в атаках."
}
