{
    "Какая память является самой быстрой в компьютере?": "регистровая память процессора",
    "Какой код используется в компьютерной технике для записи целых чисел со знаком?": "все перечисленные",
    "В динамической памяти элементы памяти построены на основе": "конденсаторов",
    "На какой элементной базе строилось третье поколение компьютеров?": "интегральные схемы",
    "Как называется устройство, выполняющее базовые логические операции?": "вентиль",
    "Что такое системы счисления?": "это знаковая система, в которой числа записываются по определенным правилам, с помощью знаков некоторого алфавита, называемых цифрами",
    "Скорость работы компьютера зависит от": "тактовой частоты обработки информации в процессоре",
    "Какая память является энергонезависимой?": "все ответы верные",
    "Промежуток времени между двумя последовательными обращениями центрального процессора к внешней оперативной памяти команд/данных или обмена 1 словом данных с периферийными устройствами называется": "машинным циклом",
    "В каком поколении компьютеров использовались каналы ввода-вывода (специальные электронные схемы, которые руководят обменом данными между процессором и внешними устройствами)?": "3",
    "Сервер на котором хранятся файлы общего доступа называется": "файл-сервер",
    "Какой элемент на схемах имеет прямоугольник с символом «=1»?": "«исключающее ИЛИ»",
    "Какая часть компьютера отвечает за хранение данных на постоянной основе?": "жесткий диск",
    "Память только для чтения - это": "ROM",
    "В состав внешней памяти компьютера входят:": "все перечисленные",
    "К основным устройствам ЭВМ относятся:": "АЛУ, УУ, ЗУ, УВВ",
    "Какие из перечисленных принципов определяют современную архитектуру компьютера:": "все перечисленные",
    "Дополните предложение: Модуль …… предназначен для автоматического тестирования устройств после включения питания компьютера.": "BIOS",
    "Промежуток между двумя импульсами тактового генератора, который синхронизирует выполнение всех операций процессора называется": "тактом ядра процессора",
    "Назовите функцию механизма прерываний:": "все ответы верны",
    "Внутренняя память компьютера физически представлена модулями": "все ответы верны",
    "Какой тип оперативной памяти используется в современных персональных компьютерах?": "DIMM",
    "Минимально допустимое время между двумя последовательными обращениями к памяти называется": "длительностью цикла",
    "Информация от ВЗУ к процессору и наоборот циркулирует по следующей цепочке:": "ВЗУ-ОЗУ-Кэш-Процессор",
    "В какой системе счисления число 4060 имеет минимальную длину записи ?": "в шестнадцатеричной",
    "Во время исполнения прикладная программа хранится": "в оперативной памяти",
    "Нулевое значение старшего бита для чисел с фиксированной точкой указывает на:": "положительное число",
    "Для какой архитектуры характерно разнообразие способов адресации операндов?": "СISС-архитектуры",
    "Для какой архитектуры несколько простых команд объединяются в одну сверхдлинную команду и выполняются параллельно?": "VLIW",
    "Под термином «интерфейс» понимается -": "внешний вид программной среды, служащий для обеспечения диалога с пользователем",
    "Арифметическо – логическое устройство (АЛУ) — это": "совокупность блоков и узлов процессора, обеспечивающая выполнение арифметических и логических операций над операндами",
    "Что такое машинное слово?": "группа байтов",
    "Время, затрачиваемое на выполнение команды, называется": "командным циклом",
    "Базовый логический элемент, реализующий логическое отрицание называется": "инвертор",
    "Каждый байт ОЗУ имеет:": "адрес",
    "Что представляет собой большая интегральная схема (БИС)?": "кристалл кремния, на котором размещаются от десятков до сотен логических элементов",
    "Идею механической машины с идеей программного управления соединил:": "Ч. Беббидж",
    "Что такое анализ данных?": "Процесс извлечения, обработки и интерпретации данных для принятия решений",
    "Какая способность позволяет агенту изменять свое поведение на основе опыта?": "Обучаемость",
    "Что такое интеграция данных?": "Процесс объединения данных из различных источников в одну систему",
    "Какая компания создала платформу Firebase?": "Google",
    "Какую функцию выполняет база знаний в интеллектуальных системах?": "Хранение и обработка данных для принятия решений",
    "Что делает обучающийся агент уникальным?": "Учится на своем опыте и улучшает свои действия со временем",
    "В каком случае двоичный поиск может быть использован?": "Список должен быть отсортированным",
    "Какой из этих форматов сжатия данных поддерживает сжатие без потерь?": "ZIP",
    "Плюсы ИИ - ?": "улучшает жизнь и решает вопросы самостоятельно",
    "Достоинства визуализации данных": "Внятная интерпретация результатов",
    "Что такое демонстрация знаний?": "Вывод знаний из базы знаний для их использования",
    "Сколько типов ИИ существует - ?": "3",
    "Для чего используется сжатие данных?": "Увеличение скорости передачи данных и экономия места на диске"
}